{"Dropout": 0.441340274093381, "LSTM": 32, "LSTM_1": 32, "LSTM_2": 16, "batch_size": 32, "choice": "two"}
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_25 (Embedding)     (None, 100, 300)          1450200   
_________________________________________________________________
LSTM_2_1 (LSTM)              (None, 100, 32)           42624     
_________________________________________________________________
LSTM_2_2 (LSTM)              (None, 32)                8320      
_________________________________________________________________
Dropout (Dropout)            (None, 32)                0         
_________________________________________________________________
dense_25 (Dense)             (None, 3)                 99        
=================================================================
Total params: 1,501,243
Trainable params: 51,043
Non-trainable params: 1,450,200
_________________________________________________________________

0.2890218033393224
0.9176666668256124
